<a href="https://colab.research.google.com/github/JakeOh/202007_iw_pyda_wkd/blob/master/py15_movielens.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [4]:
# 데이터 파일이 저장된 경로
file_path = '/content/drive/My Drive/Colab Notebooks/202007/movielens/'

# ratings.dat 파일의 컬럼 이름들
col_ratings = ['user_id', 'movie_id', 'rating', 'timestamp']

# movies.dat 파일의 컬럼 이름들
col_movies = ['movie_id', 'title', 'genres']

# users.dat 파일의 컬럼 이름들
col_users = ['user_id', 'gender', 'age', 'occupation', 'zipcode']

In [6]:
# Google Drive에 있는 파일을 열어서 데이터프레임을 생성
ratings = pd.read_csv(file_path + 'ratings.dat',
                      sep='::',             # 데이터 구분자
                      header=None,          # 헤더(컬럼 이름) 존재 여부
                      names=col_ratings,    # DF에서 사용할 컬럼 이름
                      engine='python')    
ratings.iloc[:5]

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [8]:
movies = pd.read_csv(file_path + 'movies.dat',
                     sep='::',
                     header=None,
                     names=col_movies,
                     engine='python')
movies.iloc[:5]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [10]:
users = pd.read_csv(file_path + 'users.dat',
                    sep='::',
                    header=None,
                    names=col_users,
                    engine='python')
users.iloc[:5]

   user_id gender  age  occupation zipcode
0        1      F    1          10   48067
1        2      M   56          16   70072
2        3      M   25          15   55117
3        4      M   45           7   02460
4        5      M   25          20   55455

In [12]:
print('ratings:', len(ratings))
print('movies:', len(movies))
print('users:', len(users))

ratings: 1000209
movies: 3883
users: 6040

In [13]:
# 두 개의 DF을 merge(데이터베이스: join)
df1 = pd.DataFrame({'u_id': [1, 2, 3],
                    'u_name': ['John', 'Jane', 'Jake']})
df1

   u_id u_name
0     1   John
1     2   Jane
2     3   Jake

In [14]:
df2 = pd.DataFrame({'u_id': [1, 1, 2, 2, 4],
                    'rating': [5, 4, 3, 5, 5]})
df2

   u_id  rating
0     1       5
1     1       4
2     2       3
3     2       5
4     4       5

In [15]:
pd.merge(left=df1, right=df2)  # how='inner' (기본값)

   u_id u_name  rating
0     1   John       5
1     1   John       4
2     2   Jane       3
3     2   Jane       5

In [16]:
pd.merge(left=df1, right=df2, how='left')

   u_id u_name  rating
0     1   John     5.0
1     1   John     4.0
2     2   Jane     3.0
3     2   Jane     5.0
4     3   Jake     NaN

In [17]:
pd.merge(left=df1, right=df2, how='right')

   u_id u_name  rating
0     1   John       5
1     1   John       4
2     2   Jane       3
3     2   Jane       5
4     4    NaN       5

In [18]:
pd.merge(left=df1, right=df2, how='outer')

   u_id u_name  rating
0     1   John     5.0
1     1   John     4.0
2     2   Jane     3.0
3     2   Jane     5.0
4     3   Jake     NaN
5     4    NaN     5.0

In [19]:
# ratings, movies DF을 merge
ratings_movies = pd.merge(ratings, movies)
ratings_movies.iloc[:5]

   user_id  movie_id  ...                                   title  genres
0        1      1193  ...  One Flew Over the Cuckoo's Nest (1975)   Drama
1        2      1193  ...  One Flew Over the Cuckoo's Nest (1975)   Drama
2       12      1193  ...  One Flew Over the Cuckoo's Nest (1975)   Drama
3       15      1193  ...  One Flew Over the Cuckoo's Nest (1975)   Drama
4       17      1193  ...  One Flew Over the Cuckoo's Nest (1975)   Drama

[5 rows x 6 columns]

In [20]:
len(ratings_movies)

1000209

In [21]:
# ratings_movies, users DF을 merge
df = pd.merge(ratings_movies, users)
# df = pd.merge(pd.merge(ratings, movies), users)
df.iloc[:5]

   user_id  movie_id  rating  timestamp  ... gender age occupation  zipcode
0        1      1193       5  978300760  ...      F   1         10    48067
1        1       661       3  978302109  ...      F   1         10    48067
2        1       914       3  978301968  ...      F   1         10    48067
3        1      3408       4  978300275  ...      F   1         10    48067
4        1      2355       5  978824291  ...      F   1         10    48067

[5 rows x 10 columns]

In [22]:
len(df)

1000209

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000209 entries, 0 to 1000208
Data columns (total 10 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   user_id     1000209 non-null  int64
 1   movie_id    1000209 non-null  int64
 2   rating      1000209 non-null  int64
 3   timestamp   1000209 non-null  int64
 4   title       1000209 non-null  object
 5   genres      1000209 non-null  object
 6   gender      1000209 non-null  object
 7   age         1000209 non-null  int64
 8   occupation  1000209 non-null  int64
 9   zipcode     1000209 non-null  object
dtypes: int64(6), object(4)
memory usage: 83.9+ MB

In [24]:
# 성별에 따른 영화 선호도 차이?
# 영화 제목별, 성별 평점의 평균
df.groupby(['title', 'gender'])['rating'].mean()

title                                       gender
$1,000,000 Duck (1971)                      F         3.375000
                                            M         2.761905
'Night Mother (1986)                        F         3.388889
                                            M         3.352941
'Til There Was You (1997)                   F         2.675676
                                                        ...
Zero Kelvin (Kj�rlighetens kj�tere) (1995)  M         3.500000
Zeus and Roxanne (1997)                     F         2.777778
                                            M         2.357143
eXistenZ (1999)                             F         3.098592
                                            M         3.289086
Name: rating, Length: 7152, dtype: float64

In [26]:
mean_ratings = df.pivot_table(values='rating',  # 각 컬럼에 들어갈 값.
                              index='title',    # DF의 row index로 사용할 컬럼 이름.
                              columns='gender', # DF의 컬럼 이름으로 사용할 컬럼 이름.
                              aggfunc='mean')   # aggregation function(집계 함수)
mean_ratings

gender                                             F         M
title
$1,000,000 Duck (1971)                      3.375000  2.761905
'Night Mother (1986)                        3.388889  3.352941
'Til There Was You (1997)                   2.675676  2.733333
'burbs, The (1989)                          2.793478  2.962085
...And Justice for All (1979)               3.828571  3.689024
...                                              ...       ...
Zed & Two Noughts, A (1985)                 3.500000  3.380952
Zero Effect (1998)                          3.864407  3.723140
Zero Kelvin (Kj�rlighetens kj�tere) (1995)       NaN  3.500000
Zeus and Roxanne (1997)                     2.777778  2.357143
eXistenZ (1999)                             3.098592  3.289086

[3706 rows x 2 columns]

In [29]:
# 여성들이 높은 평점을 준 영화 상위 20개
mean_ratings.sort_values(by='F', ascending=False).iloc[:20]

gender                                                F         M
title
Clean Slate (Coup de Torchon) (1981)                5.0  3.857143
Ballad of Narayama, The (Narayama Bushiko) (1958)   5.0  3.428571
Raw Deal (1948)                                     5.0  3.307692
Bittersweet Motel (2000)                            5.0       NaN
Skipped Parts (2000)                                5.0  4.000000
Lamerica (1994)                                     5.0  4.666667
Gambler, The (A J�t�kos) (1997)                     5.0  3.166667
Brother, Can You Spare a Dime? (1975)               5.0  3.642857
Ayn Rand: A Sense of Life (1997)                    5.0  4.000000
24 7: Twenty Four Seven (1997)                      5.0  3.750000
Twice Upon a Yesterday (1998)                       5.0  3.222222
Woman of Paris, A (1923)                            5.0  2.428571
I Am Cuba (Soy Cuba/Ya Kuba) (1964)                 5.0  4.750000
Gate of Heavenly Peace, The (1995)                  5.0  5.000000
For the Moment (1994)                               5.0  3.000000
Country Life (1994)                                 5.0  2.000000
Prisoner of the Mountains (Kavkazsky Plennik) (...  5.0  3.692308
Other Side of Sunday, The (S�ndagsengler) (1996)    5.0  2.928571
Saltmen of Tibet, The (1997)                        5.0  3.571429
Big Combo, The (1955)                               5.0  3.600000

In [32]:
# 영화 제목들의 빈도수
df['title'].value_counts()
# 많은 사용자들이 평가한 영화도 있고, 1~2명 평가한 영화도 존재.

American Beauty (1999)                                   3428
Star Wars: Episode IV - A New Hope (1977)                2991
Star Wars: Episode V - The Empire Strikes Back (1980)    2990
Star Wars: Episode VI - Return of the Jedi (1983)        2883
Jurassic Park (1993)                                     2672
                                                         ...
Resurrection Man (1998)                                     1
Condition Red (1995)                                        1
Foolish (1999)                                              1
Ulysses (Ulisse) (1954)                                     1
Sleepover (1995)                                            1
Name: title, Length: 3706, dtype: int64

In [33]:
df['title'].value_counts().describe()

count    3706.000000
mean      269.889099
std       384.047838
min         1.000000
25%        33.000000
50%       123.500000
75%       350.000000
max      3428.000000
Name: title, dtype: float64

In [35]:
# 250건 이상의 평가(rating)를 받은 영화들을 대상으로 분석.
title_cnt = df['title'].value_counts()
active_titles = title_cnt[title_cnt >= 250]  # boolean indexing
active_titles = active_titles.index
active_titles

Index(['American Beauty (1999)', 'Star Wars: Episode IV - A New Hope (1977)',
       'Star Wars: Episode V - The Empire Strikes Back (1980)',
       'Star Wars: Episode VI - Return of the Jedi (1983)',
       'Jurassic Park (1993)', 'Saving Private Ryan (1998)',
       'Terminator 2: Judgment Day (1991)', 'Matrix, The (1999)',
       'Back to the Future (1985)', 'Silence of the Lambs, The (1991)',
       ...
       'Man Who Knew Too Little, The (1997)', 'Bachelor, The (1999)',
       'Bicycle Thief, The (Ladri di biciclette) (1948)',
       'Take the Money and Run (1969)',
       'Teenage Mutant Ninja Turtles II: The Secret of the Ooze (1991)',
       'Presidio, The (1988)', 'Wes Craven's New Nightmare (1994)',
       'Top Hat (1935)', 'U Turn (1997)', 'Random Hearts (1999)'],
      dtype='object', length=1216)

In [39]:
# 250건 이상의 평가를 받은 영화들 중에서 
# 'F' 컬럼의 내림차순으로 정렬하고,
# 상위 20개 선택
mean_ratings.loc[active_titles].sort_values(by='F', ascending=False).iloc[:20]

gender                                                     F         M
Close Shave, A (1995)                               4.644444  4.473795
Wrong Trousers, The (1993)                          4.588235  4.478261
Sunset Blvd. (a.k.a. Sunset Boulevard) (1950)       4.572650  4.464589
Wallace & Gromit: The Best of Aardman Animation...  4.563107  4.385075
Schindler's List (1993)                             4.562602  4.491415
Shawshank Redemption, The (1994)                    4.539075  4.560625
Grand Day Out, A (1992)                             4.537879  4.293255
To Kill a Mockingbird (1962)                        4.536667  4.372611
Creature Comforts (1990)                            4.513889  4.272277
Usual Suspects, The (1995)                          4.513317  4.518248
It Happened One Night (1934)                        4.500000  4.163934
Rear Window (1954)                                  4.484536  4.472991
Seven Samurai (The Magnificent Seven) (Shichini...  4.481132  4.576628
Sixth Sense, The (1999)                             4.477410  4.379944
Third Man, The (1949)                               4.466019  4.448276
Some Like It Hot (1959)                             4.462745  4.228769
City Lights (1931)                                  4.452055  4.363636
Notorious (1946)                                    4.448718  4.211073
Philadelphia Story, The (1940)                      4.446809  4.201729
Life Is Beautiful (La Vita � bella) (1997)          4.422343  4.286624

In [40]:
mean_ratings.loc[active_titles].sort_values(by='M', ascending=False).iloc[:20]

gender                                                     F         M
Godfather, The (1972)                               4.314700  4.583333
Seven Samurai (The Magnificent Seven) (Shichini...  4.481132  4.576628
Shawshank Redemption, The (1994)                    4.539075  4.560625
Raiders of the Lost Ark (1981)                      4.332168  4.520597
Usual Suspects, The (1995)                          4.513317  4.518248
Star Wars: Episode IV - A New Hope (1977)           4.302937  4.495307
Schindler's List (1993)                             4.562602  4.491415
Wrong Trousers, The (1993)                          4.588235  4.478261
Close Shave, A (1995)                               4.644444  4.473795
Rear Window (1954)                                  4.484536  4.472991
Double Indemnity (1944)                             4.282051  4.468354
Dr. Strangelove or: How I Learned to Stop Worry...  4.376623  4.464789
Sunset Blvd. (a.k.a. Sunset Boulevard) (1950)       4.572650  4.464589
Casablanca (1942)                                   4.300990  4.461340
Third Man, The (1949)                               4.466019  4.448276
Lawrence of Arabia (1962)                           4.240506  4.439822
Godfather: Part II, The (1974)                      4.040936  4.437778
One Flew Over the Cuckoo's Nest (1975)              4.310811  4.418423
Maltese Falcon, The (1941)                          4.344681  4.410891
Great Escape, The (1963)                            4.163043  4.408940

In [42]:
# 성별 호불호 - 남녀 평점 평균의 차이 -> 파생 변수
mean_ratings_250 = mean_ratings.loc[active_titles]
mean_ratings_250['diff'] = mean_ratings_250['F'] - mean_ratings_250['M']
mean_ratings_250

gender                                                     F  ...      diff
American Beauty (1999)                              4.238901  ... -0.108400
Star Wars: Episode IV - A New Hope (1977)           4.302937  ... -0.192371
Star Wars: Episode V - The Empire Strikes Back ...  4.106481  ... -0.238096
Star Wars: Episode VI - Return of the Jedi (1983)   3.865237  ... -0.203821
Jurassic Park (1993)                                3.579407  ... -0.234791
...                                                      ...  ...       ...
Presidio, The (1988)                                3.547619  ...  0.294031
Wes Craven's New Nightmare (1994)                   2.761905  ... -0.070631
Top Hat (1935)                                      4.245763  ...  0.185612
U Turn (1997)                                       2.931034  ... -0.163988
Random Hearts (1999)                                2.483146  ...  0.240910

[1216 rows x 3 columns]

In [45]:
mean_ratings_250.sort_values(by='diff', ascending=True).iloc[:20]

gender                                         F         M      diff
Good, The Bad and The Ugly, The (1966)  3.494949  4.221300 -0.726351
Kentucky Fried Movie, The (1977)        2.878788  3.555147 -0.676359
Dumb & Dumber (1994)                    2.697987  3.336595 -0.638608
Longest Day, The (1962)                 3.411765  4.031447 -0.619682
Cable Guy, The (1996)                   2.250000  2.863787 -0.613787
Evil Dead II (Dead By Dawn) (1987)      3.297297  3.909283 -0.611985
Hidden, The (1987)                      3.137931  3.745098 -0.607167
Rocky III (1982)                        2.361702  2.943503 -0.581801
Caddyshack (1980)                       3.396135  3.969737 -0.573602
For a Few Dollars More (1965)           3.409091  3.953795 -0.544704
Porky's (1981)                          2.296875  2.836364 -0.539489
Animal House (1978)                     3.628906  4.167192 -0.538286
Exorcist, The (1973)                    3.537634  4.067239 -0.529605
Fright Night (1985)                     2.973684  3.500000 -0.526316
Barb Wire (1996)                        1.585366  2.100386 -0.515020
Rocky II (1979)                         2.741379  3.242894 -0.501515
Beavis and Butt-head Do America (1996)  2.637363  3.135417 -0.498054
Big Trouble in Little China (1986)      2.987952  3.485030 -0.497078
From Dusk Till Dawn (1996)              2.735714  3.232558 -0.496844
Wild Bunch, The (1969)                  3.636364  4.128099 -0.491736

In [48]:
# 남녀별 평점 차이가 큰 영화 20개에서 가장 많이 등장하는 장르 5개
# 1) 여성이 남성보다 더 높은 평점을 준 영화 20개의 장르
top20_female = mean_ratings_250.sort_values(by='diff',
                                            ascending=False).iloc[:20]
top20_female = top20_female.index
top20_female
# 여성이 남성보다 더 높은 평점을 준 영화 20개의 타이틀

Index(['Dirty Dancing (1987)', 'Jumpin' Jack Flash (1986)', 'Grease (1978)',
       'Little Women (1994)', 'Steel Magnolias (1989)', 'Anastasia (1997)',
       'Rocky Horror Picture Show, The (1975)', 'Color Purple, The (1985)',
       'Age of Innocence, The (1993)', 'Free Willy (1993)',
       'French Kiss (1995)', 'Little Shop of Horrors, The (1960)',
       'Guys and Dolls (1955)', 'Mary Poppins (1964)', 'Patch Adams (1998)',
       'Grease 2 (1982)', 'Sound of Music, The (1965)',
       'Never Been Kissed (1999)', 'Casper (1995)',
       'Jewel of the Nile, The (1985)'],
      dtype='object')

In [53]:
# 데이터프레임에서 특정 컬럼을 인덱스로 만듦.
df_with_index = df.set_index('title')
df_with_index

                                        user_id  movie_id  ...  occupation  zipcode
title                                                      ...
One Flew Over the Cuckoo's Nest (1975)        1      1193  ...          10    48067
James and the Giant Peach (1996)              1       661  ...          10    48067
My Fair Lady (1964)                           1       914  ...          10    48067
Erin Brockovich (2000)                        1      3408  ...          10    48067
Bug's Life, A (1998)                          1      2355  ...          10    48067
...                                         ...       ...  ...         ...      ...
Footloose (1984)                           4211      3791  ...           5    77662
MacKenna's Gold (1969)                     4211      3806  ...           5    77662
Pumpkinhead (1988)                         4211      3840  ...           5    77662
Missing in Action (1984)                   4211      3766  ...           5    77662
Bronco Billy (1980)                        4211      3834  ...           5    77662

[1000209 rows x 9 columns]

In [55]:
# 위에서 찾은 영화 타이틀 20개로 인덱싱된 부분집합.
df_with_index.loc[top20_female]['genres']

title
Dirty Dancing (1987)                             Musical|Romance
Dirty Dancing (1987)                             Musical|Romance
Dirty Dancing (1987)                             Musical|Romance
Dirty Dancing (1987)                             Musical|Romance
Dirty Dancing (1987)                             Musical|Romance
                                              ...
Jewel of the Nile, The (1985)    Action|Adventure|Comedy|Romance
Jewel of the Nile, The (1985)    Action|Adventure|Comedy|Romance
Jewel of the Nile, The (1985)    Action|Adventure|Comedy|Romance
Jewel of the Nile, The (1985)    Action|Adventure|Comedy|Romance
Jewel of the Nile, The (1985)    Action|Adventure|Comedy|Romance
Name: genres, Length: 10306, dtype: object

In [60]:
movies2 = movies.set_index('title')
female_movies = movies2.loc[top20_female]['genres']
female_movies

Dirty Dancing (1987)                                     Musical|Romance
Jumpin' Jack Flash (1986)                 Action|Comedy|Romance|Thriller
Grease (1978)                                     Comedy|Musical|Romance
Little Women (1994)                                                Drama
Steel Magnolias (1989)                                             Drama
Anastasia (1997)                            Animation|Children's|Musical
Rocky Horror Picture Show, The (1975)       Comedy|Horror|Musical|Sci-Fi
Color Purple, The (1985)                                           Drama
Age of Innocence, The (1993)                                       Drama
Free Willy (1993)                             Adventure|Children's|Drama
French Kiss (1995)                                        Comedy|Romance
Little Shop of Horrors, The (1960)                         Comedy|Horror
Guys and Dolls (1955)                                            Musical
Mary Poppins (1964)                            Children's|Comedy|Musical
Patch Adams (1998)                                          Comedy|Drama
Grease 2 (1982)                                   Comedy|Musical|Romance
Sound of Music, The (1965)                                       Musical
Never Been Kissed (1999)                                  Comedy|Romance
Casper (1995)                                       Adventure|Children's
Jewel of the Nile, The (1985)            Action|Adventure|Comedy|Romance
Name: genres, dtype: object

In [68]:
favorite_genres = []  # 여성들의 평점이 높은 영화들의 장르를 저장하기 위해서.
for genre in female_movies:
    # 각각의 영화의 장르들을 '|'로 구분한 후, 리스트에 추가
    favorite_genres.extend(genre.split('|'))

# favorite_genres  # Python list 클래스
favorite_genres = pd.Series(favorite_genres)  # list -> Series 변환
favorite_genres.value_counts()

Comedy        10
Musical        8
Romance        7
Drama          6
Children's     4
Adventure      3
Action         2
Horror         2
Thriller       1
Animation      1
Sci-Fi         1
dtype: int64